
class PromptBuild():
    def __init__(self):
        pass

    def build_prompt(self, chunks_dict: list[dict], query: str):
        context_blocks = "\n".join(
                f"""Чанк: {chunk_data["text"]}
            Автор: {chunk_data["author"]}
            Название книги: {chunk_data["name_book"]}
            Страница книги: {chunk_data["page"]}\n"""
                for chunk_data in chunks_dict
            )
        prompt = f"""Ты — интеллектуальный ассистент.  
                    Не выдумывай информацию и не ссылайся на внешний опыт. Если контекста недостаточно — так и скажи.  
                    Отвечай на вопрос, используя исключительно предоставленный контекст из книги.  

                    Правила:
                    1. Используй только информацию из предоставленных ниже фрагментов текста.  
                    2. Не домысливай и не добавляй ничего от себя.  
                    3. Форматируй ответ с использованием **Markdown-разметки** (используй списки, выделение, заголовки, цитаты и т.д. для улучшения читаемости).  
                    4. В конце каждого ответа обязательно указывай:
                    - 📘 **Фрагмент текста**, на который ты опирался  
                    - ✍️ **Автор книги**  
                    - 📖 **Название книги**  
                    - 🔢 **Номер страницы**

                    ---

                    Контекст:
                    {context_blocks}

                    Вопрос:
                    {query}

                    Ответ:
                    """
        return prompt